odasatoshi/m5stacktab/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32p4"

# Tab5: 16MB flash / 32MB HEX(x16) PSRAM
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# 1280x720 の MIPI-DSI DPI はフレームバッファを PSRAM から読み続ける。
# 20MHz (P4 のデフォルト) では帯域が足りず "dpi underrun" が出続けるため 200MHz にする。
# 200MHz は IDF_EXPERIMENTAL_FEATURES 配下なので、その依存も明示的に有効化する。
CONFIG_IDF_EXPERIMENTAL_FEATURES=y
CONFIG_SPIRAM=y
CONFIG_SPIRAM_SPEED_200M=y
CONFIG_SPIRAM_USE_MALLOC=y

# L2 キャッシュは既定の 128KB のまま。ESP32-P4 は SRAM_HIGH_SIZE = 0x80000 - L2 キャッシュサイズ
# なので、512KB にすると内蔵 SRAM の上半分 (384KB) が丸ごと消える。DPI のフレームバッファは
# DSI の DMA が PSRAM を直読みするためキャッシュを増やしても効果は間接的で、実測でも
# 200MHz 化だけで underrun は解消した。
CONFIG_CACHE_L2_CACHE_LINE_128B=y

# コンソールは USB Serial JTAG（Type-C）をプライマリにする。既定はプライマリが UART0 で、
# USB-JTAG はログ出力のみのセカンダリ扱いなので REPL の入力を受け取れない。
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y

CONFIG_FREERTOS_HZ=1000
# **メインループのスタック。** 描画・メニュー・タッチが全部ここで走る。
# 8192 だと**平常時ですら残り 3200 バイト**しかなく、接続先の削除 (#73) で
# cJSON を通すと 1660 バイトまで落ちた（実機で指でタップして測定）。
# **`menu enter` はコンソールタスク (32KB) で走るので 27484 バイトに見えていて、
# 実機を触らないと出てこない数字だった。**
# ワーカタスクに逃がしても平常時の細さは変わらないので、ここを広げる。
CONFIG_ESP_MAIN_TASK_STACK_SIZE=16384
CONFIG_COMPILER_CXX_EXCEPTIONS=y

# --- ESP32-C6 経由の WiFi (esp-hosted / SDIO) ---
# この 3 キーだけで SDIO のピン 8 本と reset GPIO 15 が Tab5 プリセットから導出される。
CONFIG_SLAVE_IDF_TARGET_ESP32C6=y
CONFIG_ESP_HOSTED_CP_TARGET_ESP32C6=y
CONFIG_ESP32P4_TAB5_C6_BOARD=y
# プリセットに default 行が無く range クランプ任せなので明示しておく（ビルド警告も消える）
CONFIG_ESP_HOSTED_HOST_RESET_GPIO=15

# 既定では esp_hosted が constructor で app_main より前に SDIO を叩き始める。Tab5 では
# それより先に I2C の IO エクスパンダで C6 の電源を入れる必要があり、間に合わない
# (電源が入る前に列挙が失敗し、以後リセットもかからないので永久に失敗する)。
# 自動初期化を切って app_main 側で「電源 → esp_hosted_init → connect」の順を明示する。
CONFIG_ESP_HOSTED_AUTO_CALL_INIT_BEFORE_APP_MAIN=n

# ESP_HOSTED_MEMPOOL_PREFER_SPIRAM は有効にしないこと。TX mempool の 1600B ストライドが
# 128B キャッシュラインと合わず (1600 % 128 = 64)、CMD53 がアライメント検査で弾かれる。

# スループット（esp-hosted の performance_optimization.md 推奨値）
CONFIG_WIFI_RMT_STATIC_RX_BUFFER_NUM=16
CONFIG_WIFI_RMT_DYNAMIC_RX_BUFFER_NUM=64
CONFIG_WIFI_RMT_DYNAMIC_TX_BUFFER_NUM=64
CONFIG_WIFI_RMT_AMPDU_TX_ENABLED=y
CONFIG_WIFI_RMT_TX_BA_WIN=32
CONFIG_WIFI_RMT_AMPDU_RX_ENABLED=y
CONFIG_WIFI_RMT_RX_BA_WIN=32
CONFIG_LWIP_TCP_SND_BUF_DEFAULT=65534
CONFIG_LWIP_TCP_WND_DEFAULT=65534
CONFIG_LWIP_TCP_RECVMBOX_SIZE=64
CONFIG_LWIP_UDP_RECVMBOX_SIZE=64
CONFIG_LWIP_TCPIP_RECVMBOX_SIZE=64
CONFIG_LWIP_TCP_SACK_OUT=y

# --- WireGuard 用の暗号 (#9) ---
# Noise IK は X25519 + ChaCha20-Poly1305 + BLAKE2s。BLAKE2s は mbedTLS に無いので自前実装。
CONFIG_MBEDTLS_CHACHA20_C=y
CONFIG_MBEDTLS_POLY1305_C=y
CONFIG_MBEDTLS_CHACHAPOLY_C=y

# mbedTLS のエラー文字列。無効だと mbedtls_strerror が何も返さず、
# 鍵のパース失敗などの原因が分からない（#17 の調査で必要になった）。
CONFIG_MBEDTLS_ERROR_STRINGS=y

# --- SD カードの接続先 (#49) ---
# **長いファイル名を有効にしないと profiles.json が見えない。** 既定は
# CONFIG_FATFS_LFN_NONE で 8.3 形式しか読めず、stat が ENOENT を返す
# （実機で踏んだ: カードには置いてあるのに「が無い」と出た）。
CONFIG_FATFS_LFN_HEAP=y
CONFIG_FATFS_MAX_LFN=255
CONFIG_FATFS_API_ENCODING_UTF_8=y

# **1 に固定する。** ts_client は esp_transport で繋ぐが、esp-tls は getaddrinfo の
# 先頭 1 件しか試さない。lwIP が 1 件しか返さないことが前提になっているので、
# 増やすなら ts_client 側にフォールバックを足すこと（#68 の ponytail コメント）。
CONFIG_LWIP_DNS_MAX_HOST_IP=1
